mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2dfxg/projects/iar/startup_s6e2df.s
                PUBWEAK GDC_SIGNA0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_SIGNA0_IRQHandler
                B       GDC_SIGNA0_IRQHandler

                PUBWEAK GDC_DISP0_SYNC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP0_SYNC0_IRQHandler
                B       GDC_DISP0_SYNC0_IRQHandler

                PUBWEAK GDC_DISP0_SYNC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP0_SYNC1_IRQHandler
                B       GDC_DISP0_SYNC1_IRQHandler

                PUBWEAK GDC_CONT_STRM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_CONT_STRM1_IRQHandler
                B       GDC_CONT_STRM1_IRQHandler

                PUBWEAK GDC_SAFE_STRM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_SAFE_STRM1_IRQHandler
                B       GDC_SAFE_STRM1_IRQHandler

                PUBWEAK GDC_DISP_STRM1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP_STRM1_IRQHandler
                B       GDC_DISP_STRM1_IRQHandler

                PUBWEAK GDC_SIGNA1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_SIGNA1_IRQHandler
                B       GDC_SIGNA1_IRQHandler

                PUBWEAK GDC_DISP1_SYNC0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP1_SYNC0_IRQHandler
                B       GDC_DISP1_SYNC0_IRQHandler

                PUBWEAK GDC_DISP1_SYNC1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP1_SYNC1_IRQHandler
                B       GDC_DISP1_SYNC1_IRQHandler

                PUBWEAK GDC_CAP_PLN0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_CAP_PLN0_IRQHandler
                B       GDC_CAP_PLN0_IRQHandler

                PUBWEAK GDC_DISP_PLN0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_DISP_PLN0_IRQHandler
                B       GDC_DISP_PLN0_IRQHandler

                PUBWEAK GDC_STRG_STRM0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_STRG_STRM0_IRQHandler
                B       GDC_STRG_STRM0_IRQHandler

                PUBWEAK GDC_HISTGRM_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_HISTGRM_IRQHandler
                B       GDC_HISTGRM_IRQHandler

                PUBWEAK DSTC_HW_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
DSTC_HW_IRQHandler
                B       DSTC_HW_IRQHandler

                PUBWEAK PCRC_I2S0_1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
PCRC_I2S0_1_IRQHandler
                B       PCRC_I2S0_1_IRQHandler

                PUBWEAK SD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
SD_IRQHandler
                B       SD_IRQHandler

                PUBWEAK FLASHIF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
FLASHIF_IRQHandler
                B       FLASHIF_IRQHandler

                PUBWEAK GDC_HSSPI_RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_HSSPI_RX_IRQHandler
                B       GDC_HSSPI_RX_IRQHandler

                PUBWEAK GDC_HSSPI_TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_HSSPI_TX_IRQHandler
                B       GDC_HSSPI_TX_IRQHandler

                PUBWEAK GDC_HSSPI_FAULT_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_HSSPI_FAULT_IRQHandler
                B       GDC_HSSPI_FAULT_IRQHandler

                PUBWEAK GDC_HYPERBUS_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
GDC_HYPERBUS_IRQHandler
                B       GDC_HYPERBUS_IRQHandler




                PUBWEAK Dummy
                SECTION .text:CODE:REORDER:NOROOT(1)
Dummy
                B       Dummy

                END
